Source/Backend/app/Http/Controllers/Dashboard/DashboardController.php

    public function index()
    {
        // Get counts for different task statuses
        $openCount = Task::where('status_id', 1)->count();
        $inProgressCount = Task::where('status_id', 2)->count();
        $closedCount = Task::where('status_id', 3)->count();

        //Get counts for different Projects statuses
        $openCount2 = Project::where('status_id', 1)->count();
        $inProgressCount2 = Project::where('status_id', 2)->count();
        $closedCount2 = Project::where('status_id', 3)->count();

        return view('control-panel.dashboard.index', [
            'statistics' => [
                'Users' => User::count(),
                'Clients' => Client::count(),
                'Organizations' => Organization::count(),
                'Projects' => Project::count(),
                'Tasks' => Task::count(),
            ],
            //tasks statistics
            'statistics2' => [
                'Open Tasks' => $openCount,
                'In Progress Tasks' => $inProgressCount,
                'Closed Tasks' => $closedCount,
            ],
            //projects statistics
            'statistics3' => [
                'Open Projects' => $openCount2,
                'In Progress Projects' => $inProgressCount2,
                'Closed Projects' => $closedCount2,
            ],

        ]);
---
select count(*) as aggregate from `tasks` where `status_id` = 1 and `tasks`.`deleted_at` is null
select count(*) as aggregate from `tasks` where `status_id` = 2 and `tasks`.`deleted_at` is null
select count(*) as aggregate from `tasks` where `status_id` = 3 and `tasks`.`deleted_at` is null
select count(*) as aggregate from `projects` where `status_id` = 1 and `projects`.`deleted_at` is null
select count(*) as aggregate from `projects` where `status_id` = 2 and `projects`.`deleted_at` is null
select count(*) as aggregate from `projects` where `status_id` = 3 and `projects`.`deleted_at` is null
select count(*) as aggregate from `users` where `users`.`deleted_at` is null
select count(*) as aggregate from `clients` where `clients`.`deleted_at` is null
select count(*) as aggregate from `organizations` where `organizations`.`deleted_at` is null
select count(*) as aggregate from `projects` where `projects`.`deleted_at` is null
select count(*) as aggregate from `tasks` where `tasks`.`deleted_at` is null